<template>
  <ContentBase>
    <div class="content">
      <h3 class="title">NTUACM历史成绩</h3>
      <pre><ol>
<li>赵迪，第十四届蓝桥杯C/C++组程序设计B组全国总决赛一等奖，2023。</li>
<li>陆玺洲，第十四届蓝桥杯Pyhton组程序设计B组全国总决赛一等奖，2023。</li>
<li>周杰、张世梁、韩愈、吴高杰，第十四届蓝桥杯C/C++组程序设计B组全国总决赛二等奖，2023。</li>
<li>赵迪、肖如航、张鑫，CCPC 江苏省赛银奖，2023。</li>
<li>周杰、张世梁、韩愈，CCPC 江苏省赛铜奖，2023。</li>
<li>周杰、张世梁、韩愈、苏展、李佳帆、蔡巧颖、陈志强、缪芸、吴高杰、陆玺州，中国高校计算机大赛 - 团体程序设计天梯赛（团队全国二等奖、江苏省一等奖），2023。</li>
<li>刘洋、杨少宇、孙长江、赵迪、俞阳程、肖如航、张鑫、陆思燕、楚昀哲、罗晟，中国高校计算机大赛 - 团体程序设计天梯赛（江苏省三等奖），2023。</li>
<li>张世梁、韩愈、苏展、蔡巧颖、李佳帆、缪芸，中国高校计算机大赛 - 团体程序设计天梯赛（个人全国三等奖），2023。</li>
<li>裴文龙，第十四届蓝桥杯Python 程序设计研究生组江苏赛区（一等奖），2023。</li>
<li>吴高杰、韩愈、张世梁、蔡巧颖、黄一麟、赵迪、刘洋、周杰、杨少宇，第十四届蓝桥杯 C/C++程序设计B组江苏赛区（一等奖），2023。</li>
<li>楚昀哲、张鑫、孙长江，第十四届蓝桥杯 C/C++程序设计B组江苏赛区（二等奖），2023。</li>
<li>陈雪娇，第十四届蓝桥杯 C/C++程序设计B组江苏赛区（三等奖），2023。</li>
<li>黄一麟，第十四届蓝桥杯 Java程序设计B组江苏赛区（一等奖），2023。</li>
<li>江媚、缪芸、蔡巧颖，2022 中国大学生程序设计竞赛（女生专场）银奖，2022。</li>
<li>叶盛、季炎、苏展，第 46 届ACM-ICPC国际大学生程序设计竞赛亚洲区总决赛EC Final（银奖），2022。</li>
<li>苏展，第十三届蓝桥杯 C/C++程序设计B组总决赛（一等奖），2022。</li>
<li>缪芸，第十三届蓝桥杯 C/C++程序设计B组总决赛（一等奖），2022。</li>
<li>周杰，第十三届蓝桥杯 C/C++程序设计B组总决赛（一等奖），2022。</li>
<li>韩愈，第十三届蓝桥杯 C/C++程序设计B组总决赛（二等奖），2022。</li>
<li>叶盛，第十三届蓝桥杯 C/C++程序设计A组总决赛（三等奖），2022。</li>
<li>张世梁，第十三届蓝桥杯 C/C++程序设计A组总决赛（三等奖），2022。</li>
<li>夏鸿崚，第十三届蓝桥杯 C/C++程序设计研究生组总决赛（三等奖），2022。</li>
<li>叶盛，2022年江苏省大学生程序设计大赛（金奖），2022。</li>
<li>周杰、吴高杰、苏展，2022年江苏省大学生程序设计大赛（铜奖），2022。</li>
<li>韩愈、孙长江、蔡巧颖，2022年江苏省大学生程序设计大赛（铜奖），2022。</li>
<li>夏鸿崚，第十三届蓝桥杯 C/C++程序设计研究生组江苏赛区（一等奖），2022。</li>
<li>叶盛、张世梁，第十三届蓝桥杯 C/C++程序设计A组江苏赛区（一等奖），2022。</li>
<li>苏展、缪芸、周杰、韩愈、蔡巧颖，第十三届蓝桥杯 C/C++程序设计B组江苏赛区（一等奖），2022。</li>
<li>吴高杰、李玉凡、吴媛媛、高朝阳、林浩、陈志强，第十三届蓝桥杯 C/C++程序设计B组江苏赛区（二等奖），2022。</li>
<li>江媚、杨少宇、翟瀚丰，第十三届蓝桥杯 C/C++程序设计B组江苏赛区（三等奖），2022。</li>
<li>苏展，叶盛，季炎，李佳帆，缪芸，缪祺，奴成昊，陈志强，周杰，张世梁，中国高校计算机大赛 - 团体程序设计天梯赛（团队全国二等奖、江苏省一等奖），2022。</li>
<li>吴高杰，黄票，陈雪娇，孙长江，王浩任，赵永超，钱卢骏，苏欣宇，蔡巧颖，韩愈，中国高校计算机大赛 - 团体程序设计天梯赛（江苏省三等奖），2022。</li>
<li>叶盛，中国高校计算机大赛 - 团体程序设计天梯赛（个人全国一等奖），2022。</li>
<li>张世梁，中国高校计算机大赛 - 团体程序设计天梯赛（个人全国三等奖），2022。</li>
<li>周杰，中国高校计算机大赛 - 团体程序设计天梯赛（个人全国三等奖），2022。</li>
<li>苏展、叶盛、季炎，2021年江苏省大学生程序设计大赛银奖，2021。</li>
<li>吴高杰、周杰、韩愈，2021年江苏省大学生程序设计大赛铜奖，2021。</li>
<li>叶盛、季炎、苏展，2021年第 46 届 ICPC 国际大学生程序设计竞赛亚洲区域赛（上海）银牌，2021。</li>
<li>叶盛、季炎、苏展，2021年第 46 届 ICPC 国际大学生程序设计竞赛亚洲区域赛（沈阳）铜牌，2021。</li>
<li>叶盛、季炎、苏展，2021年第 7 届中国大学生程序设计竞赛（CCPC）广州站银牌，2021。</li>
<li>缪芸、李玉凡、江媚，2021年中国大学生程序设计竞赛女生专场铜奖，2021。</li>
<li>张世梁，第12届蓝桥杯C/C++程序设计本科B组（国一），2021。</li>
<li>李佳帆，第12届蓝桥杯C/C++程序设计本科B组（国一），2021。</li>
<li>缪芸，第12届蓝桥杯C/C++程序设计本科B组（国二），2021。</li>
<li>李玉凡，第12届蓝桥杯C/C++程序设计本科B组（国二），2021。</li>
<li>苏展，第12届蓝桥杯C/C++程序设计本科B组（国三），2021。</li>
<li>高朝阳，第12届蓝桥杯C/C++程序设计本科B组（国三），2021。</li>
<li>李佳帆、苏展、朱卓宁，中国大学生程序设计竞赛全国邀请赛（湖南）银牌，2021。</li>
<li>陈志强、李玉凡、缪芸，中国大学生程序设计竞赛全国邀请赛（湖南）铜牌，2021。</li>
<li>叶盛、季炎、奴成昊，2021年“深圳计算科学研究院杯”杯第三届湖北省大学生程序设计竞赛(决赛)银奖，2021。</li>
<li>叶盛、季炎、奴成昊，第45届ICPC国际大学生程序设计竞赛亚洲区域赛（银川）铜牌，2021。</li>
<li>叶盛等人，中国高校计算机大赛 - 团体程序设计天梯赛（团队全国三等奖），2021。</li>
<li>缪芸等人，中国高校计算机大赛 - 团体程序设计天梯赛（团队全国成功参与奖），2021。</li>
<li>苏展，朱卓宁，缪芸，张世梁，缪祺，葛骅，李佳帆，翟瀚丰，高朝阳，邵栋昊，第12届蓝桥杯C/C++程序设计本科B组（江苏省一等奖），2021。</li>
<li>李建柯，吴高杰，王昭，陈志强，许舒源，林浩，第12届蓝桥杯C/C++程序设计本科B组（江苏省二等奖），2021。</li>
<li>蔡巧颖，韩愈，第12届蓝桥杯C/C++程序设计本科B组（江苏省三等奖），2021。</li>
<li>叶盛、季炎、奴成昊，第45届ICPC国际大学生程序设计竞赛亚洲区域赛（昆明）铜牌，2021。</li>
<li>李佳帆、苏展、朱卓宁，第45届ICPC国际大学生程序设计竞赛亚洲区域赛（昆明）铜牌，2021。</li>
<li>叶盛、季炎、奴成昊，2020年江苏省大学生程序设计赛银奖，2020。</li>
<li>李佳帆、苏展、朱卓宁，2020年江苏省大学生程序设计赛铜奖，2020。</li>
<li>赵静珂、叶盛、缪祺，第44届ICPC国际大学生程序设计竞赛亚洲区域赛（南昌）铜牌，2019。</li>
<li>马思赜、赵静珂、叶盛，2019年江苏省大学生程序设计大赛（南京）一等奖，2019。</li>
<li>王淦、李昊洋、沈天任，2019年江苏省大学生程序设计大赛（南京）三等奖，2019。</li>
<li>马思赜，第9届蓝桥杯C/C++程序设计本科B组（全国一等奖），2018。</li>
<li>李昊洋，第9届蓝桥杯C/C++程序设计本科B组（全国二等奖），2018。</li>
<li>谢隽丰，第9届蓝桥杯C/C++程序设计本科B组（全国二等奖），2018。</li>
<li>刘猛，第9届蓝桥杯JAVA程序设计本科B组（全国二等奖），2018。</li>
<li>马思赜、李昊洋、谢隽丰，第9届蓝桥杯C/C++程序设计本科B组（江苏省一等奖），2018。</li>
<li>刘猛，第9届蓝桥杯JAVA程序设计本科B组（江苏省一等奖），2018。</li>
<li>李昊洋、王淦、赵静柯，2018年ACM-ICPC国际大学生程序设计竞赛全国邀请赛（上海）银牌，2018。</li>
<li>王淦、李昊洋、谢隽丰，ACM-ICPC国际大学生程序设计竞赛全国邀请赛（江苏）铜牌，2018。</li>
<li>沈逸淳、张辰康、赵海洲，江苏省大学生程序设计大赛（南京）三等奖，2018。</li>
<li>沈宇翔、谢隽丰、马思赜，第42届ACM国际大学生程序设计竞赛亚洲区域赛（北京）铜牌，2017。</li>
<li>沈宇翔、谢隽丰、马思赜，第42届ACM国际大学生程序设计竞赛亚洲区域赛（青岛）铜牌，2017。</li>
<li>李昊洋、王淦、刘猛，第42届ACM国际大学生程序设计竞赛亚洲区域赛（西安）铜牌，2017。</li>
<li>徐中彦，第8届蓝桥杯C/C++程序设计本科B组（全国二等奖），2017。</li>
<li>沈宇翔，第8届蓝桥杯C/C++程序设计本科B组（全国二等奖），2017。</li>
<li>刘猛，第8届蓝桥JAVA程序设计本科B组（全国二等奖），2017。</li>
<li>刘猛，第8届蓝桥杯Java程序设计本科B组（江苏省一等奖），2017。</li>
<li>赵英全、窦祖俊，第8届蓝桥杯C/C++程序设计本科B组（江苏省一等奖），2017。</li>
<li>于立行，第8届蓝桥杯C/C++程序设计本科B组（江苏省二等奖），2017。</li>
<li>魏世鑫、袁智丹、高秋实、刘相男、田三川，第8届蓝桥杯C/C++程序设计本科B组（江苏省三等奖），2017。</li>
<li>徐中彦，第7届蓝桥杯C/C++程序设计本科B组（全国一等奖），2016。</li>
<li>沈宇翔，第7届蓝桥杯C/C++程序设计本科B组（全国二等奖），2016。</li>
<li>陈克强，第7届蓝桥杯JAVA程序设计本科B组（全国二等奖），2016。</li>
<li>陈克强，第7届蓝桥杯Java程序设计本科B组（江苏省一等奖），2016。</li>
<li>刘猛、徐中彦、沈宇翔，第7届蓝桥杯C/C++程序设计本科B组（江苏省一等奖），2016。</li>
<li>张亦晶，第7届蓝桥杯C/C++程序设计本科B组（江苏省二等奖），2016。</li>
<li>龚雨濛、常贺，第7届蓝桥杯C/C++程序设计本科B组（江苏省三等奖），2016。</li>
<li>贺成，第6届蓝桥杯C/C++程序设计本科B组（江苏省二等奖），2015。</li>
<li>李亚东，第6届蓝桥杯C/C++程序设计本科B组（江苏省三等奖），2015。</li>
<li>李炬，第5届蓝桥杯C/C++程序设计本科B组（江苏省二等奖），2014。</li>
<li>谭兆飞，第5届蓝桥杯C/C++程序设计本科B组（江苏省三等奖），2014。</li>
<li>石鸿斌，第4届蓝桥杯C/C++程序设计本科B组（全国二等奖），2013。</li>
<li>石鸿斌，第4届蓝桥杯C/C++程序设计本科B组（江苏省一等奖），2013。</li>
<li>李炬、谭兆飞、何鹏飞，第4届蓝桥杯C/C++程序设计本科B组（江苏省三等奖），2013。</li>
<li>石鸿斌，第7届中国航信杯全国信息技术应用水平大赛（省级二等奖），2012。</li>
    </ol></pre>
    </div>
  </ContentBase>
</template>

<script>
import ContentBase from '@/components/ContentBase.vue'

export default {
  name: 'Achievement',
  components: { ContentBase }

}
</script>

<style scoped>
.content {
  font-size: 18px;
}

.title {
  text-align: center;
}

pre {
    white-space: pre-wrap;
    word-wrap: break-word;
}
</style>
