export default {
  // 代办事项
  textbook: [{
    id: '1', // 编号
    name: '周娟。程序设计竞赛入门。中国水利水电出版社。2021' // 名称
  }, {
    id: '2', // 编号
    name: '刘汝佳，陈锋。算法竞赛入门经典、训练指南、算法实现、习题与解答' // 名称
  }, {
    id: '3', // 编号
    name: '罗勇军，郭卫斌 。算法竞赛。清华大学出版社。2022' // 名称
  }, {
    id: '4', // 编号
    name: '陈小玉。算法训练营（入门篇、进阶篇）。电子工业出版社。2022' // 名称
  }, {
    id: '5', // 编号
    name: '秋叶拓哉，岩田阳一，北川宜稔 。挑战程序设计竞赛（第2版）（卷1和卷2）。人民邮电出版社。2013，2016' // 名称
  }, {
    id: '6', // 编号
    name: '付东来。labuladong的算法小抄。电子工业出版社。2020' // 名称
  }, {
    id: '7', // 编号
    name: '孙秀洋。代码随想录，跟着Carl学算法。电子工业出版社。2021' // 名称
  }, {
    id: '8', // 编号
    name: '啊哈磊。啊哈！算法。人民邮电出版社。2021' // 名称
  }, {
    id: '9', // 编号
    name: '吴军。计算之魂。人民邮电出版社。2021' // 名称
  }]
}
